Revit 2026 API

# ExporterIFCRegisterSpaceBoundingElementHandle Method

---

Stores a handle representing a space bounding element to the ExporterIFC's internal cache.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RegisterSpaceBoundingElementHandle(
	IFCAnyHandle instanceHandle,
	ElementId id,
	ElementId levelId
)
```
```vb
Public Sub RegisterSpaceBoundingElementHandle (
	instanceHandle As IFCAnyHandle,
	id As ElementId,
	levelId As ElementId
)
```
```cpp
public:
void RegisterSpaceBoundingElementHandle(
	IFCAnyHandle^ instanceHandle,
	ElementId^ id,
	ElementId^ levelId
)
```
```fsharp
member RegisterSpaceBoundingElementHandle :
        instanceHandle : IFCAnyHandle *
        id : ElementId *
        levelId : ElementId -> unit
```

#### Parameters

instanceHandle IFCAnyHandle
     The handle to the space bounding element.
id ElementId
     The Revit element id associated to this handle.
levelId ElementId
     The level id assigned to the space bounding object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The cache of space bounding elements will be used during completion of export to create relationship objects such as IfcRelSpaceBoundary and IfcRelConnectsPathElements. The types of Revit elements accepted by this function are:

  * Walls
  * Curtain walls
  * Roofs
  * Floors
  * Doors
  * Windows

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace